## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/14876246359)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 4 to add, 0 to change, 4 to destroy.</code></pre>

* Create
  * module.docker_dev_registry.google_artifact_registry_repository.artifact_registry
  * module.prod_docker_registry.google_artifact_registry_repository.artifact_registry
* Delete
  * module.docker_dev.google_artifact_registry_repository.artifact_registry
  * module.prod_docker_repository.google_artifact_registry_repository.artifact_registry
* Replace
  * google_artifact_registry_repository_iam_member.image_syncer_prod_repo_reader
  * google_artifact_registry_repository_iam_member.image_syncer_prod_repo_writer



<details><summary>Change Result (Click me)</summary>

```hcl

  # google_artifact_registry_repository_iam_member.image_syncer_prod_repo_reader must be replaced
-/+ resource "google_artifact_registry_repository_iam_member" "image_syncer_prod_repo_reader" {
      ~ etag       = "BwYiUA++Yos=" -> (known after apply)
      ~ id         = "projects/kyma-project/locations/europe/repositories/prod/roles/artifactregistry.reader/serviceAccount:image-syncer-reader@sap-kyma-prow.iam.gserviceaccount.com" -> (known after apply)
      ~ project    = "kyma-project" -> (known after apply)
      ~ repository = "projects/kyma-project/locations/europe/repositories/prod" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # google_artifact_registry_repository_iam_member.image_syncer_prod_repo_writer must be replaced
-/+ resource "google_artifact_registry_repository_iam_member" "image_syncer_prod_repo_writer" {
      ~ etag       = "BwYiUA++Yos=" -> (known after apply)
      ~ id         = "projects/kyma-project/locations/europe/repositories/prod/roles/artifactregistry.createOnPushWriter/serviceAccount:image-syncer-writer@sap-kyma-prow.iam.gserviceaccount.com" -> (known after apply)
      ~ project    = "kyma-project" -> (known after apply)
      ~ repository = "projects/kyma-project/locations/europe/repositories/prod" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.docker_dev.google_artifact_registry_repository.artifact_registry will be destroyed
  # (because google_artifact_registry_repository.docker_dev was moved to module.docker_dev.google_artifact_registry_repository.artifact_registry, which is not in configuration)
  # (moved from google_artifact_registry_repository.docker_dev)
  - resource "google_artifact_registry_repository" "artifact_registry" {
      - cleanup_policy_dry_run = false -> null
      - create_time            = "2022-10-11T11:17:17.110033Z" -> null
      - description            = "Development images for kyma-project" -> null
      - effective_labels       = {
          - "type" = "development"
        } -> null
      - format                 = "DOCKER" -> null
      - id                     = "projects/kyma-project/locations/europe/repositories/dev" -> null
      - labels                 = {
          - "type" = "development"
        } -> null
      - location               = "europe" -> null
      - mode                   = "STANDARD_REPOSITORY" -> null
      - name                   = "dev" -> null
      - project                = "kyma-project" -> null
      - repository_id          = "dev" -> null
      - terraform_labels       = {
          - "type" = "development"
        } -> null
      - update_time            = "2025-05-07T05:27:47.856094Z" -> null

      - cleanup_policies {
          - action = "DELETE" -> null
          - id     = "delete-untagged" -> null

          - condition {
              - package_name_prefixes = [] -> null
              - tag_prefixes          = [] -> null
              - tag_state             = "UNTAGGED" -> null
              - version_name_prefixes = [] -> null
            }
        }
      - cleanup_policies {
          - action = "DELETE" -> null
          - id     = "delete-old-pr-images" -> null

          - condition {
              - older_than            = "2592000s" -> null
              - package_name_prefixes = [] -> null
              - tag_prefixes          = [
                  - "PR-",
                ] -> null
              - tag_state             = "TAGGED" -> null
              - version_name_prefixes = [] -> null
            }
        }

      - docker_config {
          - immutable_tags = false -> null
        }
    }

  # module.docker_dev_registry.google_artifact_registry_repository.artifact_registry will be created
  + resource "google_artifact_registry_repository" "artifact_registry" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + description            = "Development images for kyma-project"
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "dev"
          + "owner"                      = "neighbors"
          + "type"                       = "development"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + labels                 = {
          + "name"  = "dev"
          + "owner" = "neighbors"
          + "type"  = "development"
        }
      + location               = "europe"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "kyma-project"
      + repository_id          = "dev"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "dev"
          + "owner"                      = "neighbors"
          + "type"                       = "development"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-untagged"

          + condition {
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "UNTAGGED"
              + version_name_prefixes = []
            }
        }
      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-old-pr-images"

          + condition {
              + older_than            = "2592000s"
              + package_name_prefixes = []
              + tag_prefixes          = [
                  + "PR-",
                ]
              + tag_state             = "TAGGED"
              + version_name_prefixes = []
            }
        }

      + docker_config {
          + immutable_tags = false
        }
    }

  # module.prod_docker_registry.google_artifact_registry_repository.artifact_registry will be created
  + resource "google_artifact_registry_repository" "artifact_registry" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + description            = "Production images for kyma-project"
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "prod"
          + "owner"                      = "neighbors"
          + "type"                       = "production"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + labels                 = {
          + "name"  = "prod"
          + "owner" = "neighbors"
          + "type"  = "production"
        }
      + location               = "europe"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "kyma-project"
      + repository_id          = "prod"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "prod"
          + "owner"                      = "neighbors"
          + "type"                       = "production"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-untagged"

          + condition {
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "UNTAGGED"
              + version_name_prefixes = []
            }
        }

      + docker_config {
          + immutable_tags = false
        }
    }

  # module.prod_docker_repository.google_artifact_registry_repository.artifact_registry will be destroyed
  # (because google_artifact_registry_repository.prod_docker_repository was moved to module.prod_docker_repository.google_artifact_registry_repository.artifact_registry, which is not in configuration)
  # (moved from google_artifact_registry_repository.prod_docker_repository)
  - resource "google_artifact_registry_repository" "artifact_registry" {
      - cleanup_policy_dry_run = false -> null
      - create_time            = "2022-10-11T11:18:44.273370Z" -> null
      - description            = "Production images for kyma-project" -> null
      - effective_labels       = {
          - "type" = "production"
        } -> null
      - format                 = "DOCKER" -> null
      - id                     = "projects/kyma-project/locations/europe/repositories/prod" -> null
      - labels                 = {
          - "type" = "production"
        } -> null
      - location               = "europe" -> null
      - mode                   = "STANDARD_REPOSITORY" -> null
      - name                   = "prod" -> null
      - project                = "kyma-project" -> null
      - repository_id          = "prod" -> null
      - terraform_labels       = {
          - "type" = "production"
        } -> null
      - update_time            = "2025-05-07T05:38:09.083108Z" -> null

      - cleanup_policies {
          - action = "DELETE" -> null
          - id     = "delete-untagged" -> null

          - condition {
              - package_name_prefixes = [] -> null
              - tag_prefixes          = [] -> null
              - tag_state             = "UNTAGGED" -> null
              - version_name_prefixes = [] -> null
            }
        }

      - docker_config {
          - immutable_tags = false -> null
        }
    }

Plan: 4 to add, 0 to change, 4 to destroy.

Changes to Outputs:
  ~ artifact_registry                              = {
      ~ modules-internal = {
          ~ artifact_registry_collection = {
                id                        = "projects/kyma-project/locations/europe/repositories/modules-internal"
                name                      = "modules-internal"
              ~ update_time               = "2025-05-05T07:56:35.834061Z" -> "2025-05-06T14:04:03.413143Z"
                # (18 unchanged attributes hidden)
            }
        }
    }
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry has changed
  ~ resource "google_artifact_registry_repository" "artifact_registry" {
        id                     = "projects/kyma-project/locations/europe/repositories/modules-internal"
        name                   = "modules-internal"
      ~ update_time            = "2025-05-05T07:56:35.834061Z" -> "2025-05-06T14:04:03.413143Z"
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>







<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":13023,"Program":"tfcmt","SHA1":"eb7de3e7400acf18e1b6f6ff8b140fc0e3a30754","Vars":{},"WorkflowName":"Pull Plan Prod Terraform"} -->